In [3]:
import pandas as pd

In [4]:
data1 = [ (1001 , 'Alexi' , 'A' , 95) ,
          (1002 , 'Brian' , 'B' , 88) ,
          (1003 , 'Chris' , 'C' , 79) ,
          (1004 , 'Drake' , 'A' , 85) ,
          (1005 , 'Esaan' , 'B' , 54) ,
          (1006 , 'Frank' , 'C' , 65 ),
          (1007 , 'Grant' , 'B' , 97)
        ]
df1 = pd.DataFrame (data1, columns = ['Roll no.' , 'Name' , 'Section' , 'Maths'])
df1

   Roll no.   Name Section  Maths
0      1001  Alexi       A     95
1      1002  Brian       B     88
2      1003  Chris       C     79
3      1004  Drake       A     85
4      1005  Esaan       B     54
5      1006  Frank       C     65
6      1007  Grant       B     97

## Dealing with NaN

In [5]:
import numpy as np

numbers = {'Column A': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],
           'Column B': [11,12,np.nan,13,14,np.nan,15,16,np.nan,np.nan,17,np.nan,19],
           'Column C': range(100,113)}
df = pd.DataFrame (numbers, columns = ['Column A' , 'Column B' , 'Column C'])
df

    Column A  Column B  Column C
0        1.0      11.0       100
1        2.0      12.0       101
2        3.0       NaN       102
3        4.0      13.0       103
4        5.0      14.0       104
5        NaN       NaN       105
6        6.0      15.0       106
7        7.0      16.0       107
8        NaN       NaN       108
9        8.0       NaN       109
10       9.0      17.0       110
11      10.0       NaN       111
12       NaN      19.0       112

In [6]:
is_nan = df["Column A"].isna()      # Method 1 (output is a Series)
is_nan

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8      True
9     False
10    False
11    False
12     True
Name: Column A, dtype: bool

In [7]:
is_nan = df["Column A"].isnull()     # Method 2
is_nan

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8      True
9     False
10    False
11    False
12     True
Name: Column A, dtype: bool

In [8]:
is_nan = df["Column B"].isna().values  # Output is array
is_nan

array([False, False,  True, False, False,  True, False, False,  True,
        True, False,  True, False])

In [9]:
is_nan = df["Column B"].isna().values.any()  # Output is Boolean telling you if column has NaN
is_nan

True

In [10]:
total_nan = df["Column B"].isna().sum()  # Output is integer telling how many NaN 
total_nan

5

In [11]:
nan_vals = df.isna()
nan_vals

    Column A  Column B  Column C
0      False     False     False
1      False     False     False
2      False      True     False
3      False     False     False
4      False     False     False
5       True      True     False
6      False     False     False
7      False     False     False
8       True      True     False
9      False      True     False
10     False     False     False
11     False      True     False
12      True     False     False

In [12]:
nan_vals = df.isna().any()
nan_vals

Column A     True
Column B     True
Column C    False
dtype: bool

In [13]:
nan_columns = nan_vals
cols_w_nan = df.columns[nan_columns].tolist()
cols_w_nan

['Column A', 'Column B']

In [14]:
#################################

In [15]:
###################################

In [16]:
#####################################

## Dealing with Categories

### Nominal -- Ordinal -- Cardinal

#### A nominal number names something for identification - phone number, player number
#### An ordinal number tells us the order of things (rank/position) - first, second, third
#### A cardinal number tells us 'how many' showing quantity

In [17]:
data2= [ ('Alex'  , 'Average'    , 65) ,
         ('Brian' , 'Brilliant'  , 90) ,
         ('Chris' , 'Outstanding', 100) ,
         ('Drake' , 'Average'    , 68),
         ('Fred'  , 'Good'       , 80)]
df2 = pd.DataFrame (data2, columns = ['Name', 'Performance','Marks'])
df2

    Name  Performance  Marks
0   Alex      Average     65
1  Brian    Brilliant     90
2  Chris  Outstanding    100
3  Drake      Average     68
4   Fred         Good     80

In [18]:
data3= [ ('India'     , 'Average'    ,65) ,
         ('Australia' , 'Brilliant'  ,90) ,
         ('USA'       , 'Outstanding',100) ,
         ('Bangladesh', 'Average'    ,68),
         ('Japan'     , 'Good'       ,80)]
df3 = pd.DataFrame (data3, columns = ['Country', 'Performance','Medals'])
df3

      Country  Performance  Medals
0       India      Average      65
1   Australia    Brilliant      90
2         USA  Outstanding     100
3  Bangladesh      Average      68
4       Japan         Good      80

#### We apply One-Hot Encoding when: The category is not ordinal (like countries)
#### We apply Label Encoding when: The category is ordinal (like Performance)

In [19]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

df3['Performance'] = le.fit_transform (df3['Performance'])
df3

      Country  Performance  Medals
0       India            0      65
1   Australia            1      90
2         USA            3     100
3  Bangladesh            0      68
4       Japan            2      80

In [22]:
df4 = pd.get_dummies(df3, columns = ['Country'])
df4

,Performance,Medals,Country_Australia,Country_Bangladesh,Country_India,Country_Japan,Country_USA
0,0,65,0,0,1,0,0
1,1,90,1,0,0,0,0
2,3,100,0,0,0,0,1
3,0,68,0,1,0,0,0
4,2,80,0,0,0,1,0

In [21]:
df5 = df4.to_csv('Encoded_data_country.csv', index = False)
df5